Tekla.Structures.Model.ClashCheckData.ClashTypeEnum
An enumeration for the different clash types.

Tekla.Structures.Model.ClashCheckData.ClashTypeEnum.CLASH_TYPE_INVALID
The invalid clash type.

Tekla.Structures.Model.ClashCheckData.ClashTypeEnum.CLASH_TYPE_ISINSIDE
One object is inside the other object.

Tekla.Structures.Model.ClashCheckData.ClashTypeEnum.CLASH_TYPE_EXACTMATCH
The exact match clash type.

Tekla.Structures.Model.ClashCheckData.ClashTypeEnum.CLASH_TYPE_CLASH
The unidentified clash type.

Tekla.Structures.Model.ClashCheckData.ClashTypeEnum.CLASH_TYPE_MINDISTANCE
The minimum distance clash type.

Tekla.Structures.Model.ClashCheckData.ClashTypeEnum.CLASH_TYPE_FAILEDSOLID
The failed solid clash type.

Tekla.Structures.Model.ClashCheckData.ClashTypeEnum.CLASH_TYPE_CUTTHROUGH
The cut through clash type.

Tekla.Structures.Model.ClashCheckData.ClashTypeEnum.CLASH_TYPE_COMPLEXCLASH
The complex clash type.

Tekla.Structures.Model.ClashCheckData.ClashTypeEnum.CLASH_TYPE_FAILEDTEST
The failed test clash type.